[
  {
    "id": 434317,
    "title": "BEL SET - Jobs market presentations to university- Department of Employment",
    "summary": "Jobs market presentations to university- Department of Employment",
    "details": "<p>Presented by Ivan Neville<br>Labour Market Research and Analysis Branch<br>Department of Employment</p>",
    "venue": "Schonell Theatre",
    "startUtc": "2016-08-09T14:00:00+10:00",
    "endUtc": "2016-08-09T17:00:00+10:00",
    "start": "2016-08-10T00:00:00+10:00",
    "end": "2016-08-10T03:00:00+10:00",
    "email": "careers@bel.uq.edu.au",
    "phone": "07 3365 4222"
  },
  {
    "id": 439800,
    "title": "TEST - do not book:Databases for Engineering Honours ",
    "summary": "Learn about the databases you should be using for research",
    "details": "<p>test research session for honours</p>",
    "venue": "St Lucia, \r\n\r\nDorothy Hill Engineering & Sciences Library, \r\n\r\nHawken Bldg (50), \r\n\r\neZone , Level 2",
    "startUtc": "2016-07-12T11:00:00+10:00",
    "endUtc": "2016-07-12T12:00:00+10:00",
    "start": "2016-07-12T21:00:00+10:00",
    "end": "2016-07-12T22:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 442519,
    "title": "UQ 2016 Student Summit - Think Tank Session",
    "summary": "This interactive workshop will help you to prepare for the Summit, by working in groups to summarise the key issues for discussion at the event.\r\n\r\nThis event is only available to successful candidates for the UQ 2016 Student Summit program.",
    "details": "<p>This interactive workshop will help you to prepare for the Summit, by working in groups to summarise the key issues for discussion at the event.</p><p>This event is only available to successful candidates for the UQ 2016 Student Summit program.</p>",
    "venue": "Room 273- Global Change Institute Building # 20",
    "startUtc": "2016-07-21T08:30:00+10:00",
    "endUtc": "2016-07-21T10:30:00+10:00",
    "start": "2016-07-21T18:30:00+10:00",
    "end": "2016-07-21T20:30:00+10:00",
    "email": "b.brear@uq.edu.au",
    "phone": ""
  },
  {
    "id": 442520,
    "title": "UQ 2016 Student Summit - Think Tank Session",
    "summary": "This interactive workshop will help you to prepare for the Summit, by working in groups to summarise the key issues for discussion at the event.\r\n\r\nThis event is only available to successful candidates for the UQ 2016 Student Summit program.",
    "details": "<p>This interactive workshop will help you to prepare for the Summit, by working in groups to summarise the key issues for discussion at the event.</p><p>This event is only available to successful candidates for the UQ 2016 Student Summit program.</p>",
    "venue": "Room 273- Global Change Institute Building # 20",
    "startUtc": "2016-07-22T08:30:00+10:00",
    "endUtc": "2016-07-22T10:30:00+10:00",
    "start": "2016-07-22T18:30:00+10:00",
    "end": "2016-07-22T20:30:00+10:00",
    "email": "b.brear@uq.edu.au",
    "phone": ""
  },
  {
    "id": 442521,
    "title": "UQ 2016 Student Summit",
    "summary": "You will have the opportunity to hear from members of UQ's senior executive about UQ's strategic direction and priorities for the coming year with an opportunity to ask key questions and give feedback.",
    "details": "<p>You will have the opportunity to hear from members of UQ's senior executive about UQ's strategic direction and priorities for the coming year with an opportunity to ask key questions and give feedback.</p>",
    "venue": "Terrace Room, Level 6, Sir Llew Edwards Building # 14",
    "startUtc": "2016-08-15T16:00:00+10:00",
    "endUtc": "2016-08-15T19:30:00+10:00",
    "start": "2016-08-16T02:00:00+10:00",
    "end": "2016-08-16T05:30:00+10:00",
    "email": "b.brear@uq.edu.au",
    "phone": ""
  },
  {
    "id": 444332,
    "title": "2016 Volunteer Expo",
    "summary": "With over 45 charities and not-for-profit exhibitors attending, the UQ Volunteer Expo is the perfect event for you to find out more about volunteer organisations, available volunteering positions and the type of experience which might suit you best.",
    "details": "<p><img style=\"width: 598px;\" src=\"https://www.careerhub.uq.edu.au/Uploads/Images/vols-expo-website-banner.jpg\"></p><p>8th Annual UQ Volunteer Expo</p><p>Here is the perfect event for you to find out more about volunteering!</p><p>Many employers are looking for well-rounded graduates who have more  on their resume than just study. Volunteering is a great way to give  back to the community, meet new people, and develop transferrable  workplace skills.  It’s a win-win situation!</p><p>With a variety of exhibitors, this is your chance to speak  with organisations such as Woodford Folk Festival, Conservation  Volunteers Australia, Multicultural Development Association and the  RSPCA just to name a few!  There will be puppies and free fairy floss!</p><p>Come along to explore opportunities, get experience, improve your resume and develop your community spirit!</p><p><strong>This is a free event and all UQ students and staff are welcome to attend.&nbsp;&nbsp;</strong></p><p>Holt Room<br>UQ Union Complex<br>Building 21C</p><p>Wednesday 17 August 2016</p><p>10:00-1:00</p><p><strong></strong></p>",
    "venue": "Holt Room\r\nUQ Union Complex\r\nBuilding 21C",
    "startUtc": "2016-08-17T10:00:00+10:00",
    "endUtc": "2016-08-17T13:00:00+10:00",
    "start": "2016-08-17T20:00:00+10:00",
    "end": "2016-08-17T23:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444339,
    "title": "Employers on Campus:  Suncorp, EY & QIC",
    "summary": "Recent graduates from Suncorp, EY and QIC will provide you with insights, advice and their personal stories on how they prepared for graduation, including choosing employers, surviving the recruitment process and ultimately moving from study to work.",
    "details": "<p>Suncorp Group provides banking, wealth and insurance products and services across Australia and New Zealand.EY's purpose is to build a better working world through our own actions and by engaging with like-minded organisations and individuals. QIC delivers investment outcomes for its clients, created in 1991 by the Queensland government to serve its long term investment responsibilities.</p><p><strong>Presentation:</strong>Recent graduates from Suncorp, EY and QIC will provide you with insights, advice and their personal stories on how they prepared for graduation, including choosing employers, surviving the recruitment process and ultimately moving from study to work.</p><p><strong>Presentation Content:</strong> Transitioning from study to career - a panel of grads from Suncorp, Ernst &amp; Young (EY) and Qld Investment Corporation (QIC) will answer your questions about applying for grad roles, starting in a new job, using your degree and career options across the Finance industry (for many disciplines). Will also include key considerations for students as they progress through their degree on what to look out for and how to prepare for a graduate position in a corporate environment.</p><p><strong>26 July 2016 1:30 -3:30</strong></p><p><strong>Terrace Room, Building 14 Level 6</strong></p><p>St. Lucia Campus</p><p><strong>Register your attendance below.</strong></p>",
    "venue": "Terrace Room, Building 14 Level 6\r\nSt. Lucia Campus",
    "startUtc": "2016-07-26T13:30:00+10:00",
    "endUtc": "2016-07-26T15:30:00+10:00",
    "start": "2016-07-26T23:30:00+10:00",
    "end": "2016-07-27T01:30:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444342,
    "title": "Employers on Campus:  Qld Dept of Environment & Heritage Protection (EHP)",
    "summary": "Come and hear about the exciting opportunities available to you through Qld Department of Environment & Heritage Protection.",
    "details": "<p>Want to start your career in a diverse and dynamic organisation? If so, the Greater Graduate Program offers you a unique opportunity to build your career and grow with the Queensland Government. The program provides graduates with an opportunity to work in roles within six Queensland Government departments.</p><p>Presentation Content:Graduate opportunities in the Greater Graduate Program and how to prepare your application.</p><p>Thursday 28 July 10:00-12:00</p><p>Room 313A Building 49</p><p>St. Lucia Campus</p><p>Register your interest below.</p>",
    "venue": "Room 313A Building 49\r\nSt. Lucia Campus",
    "startUtc": "2016-07-28T12:00:00+10:00",
    "endUtc": "2016-07-28T14:00:00+10:00",
    "start": "2016-07-28T22:00:00+10:00",
    "end": "2016-07-29T00:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444526,
    "title": "Employers on Campus:  KordaMentha",
    "summary": "KordaMentha graduates have the opportunity to do more with their degree. The work is interesting, diverse and often complex, whether it be as part of our Restructuring, Forensic or Real estate teams.",
    "details": "<p>KordaMentha is an advisory and investment firm that provides Forensic, Real Estate, Turnaround and Restructuring Services. Whether our clients are looking to expand, invest, detect inappropriate behaviour or overcome under-performance within their organisation, our team of almost 350 business specialists draw upon their extensive industry and functional experience to deliver the best outcomes for stakeholders.</p><p>KordaMentha graduates have the opportunity to do more with their degree. The work is interesting, diverse and often complex, whether it be as part of our Restructuring, Forensic or Real estate teams.</p><p>Presentation Content:Overview of KordaMentha and what we do. We'll also touch on building your network.</p><p>Terrace Room, Level 6 of Building 14</p><p>UQ St. Lucia Campus</p><p>27 July 2016</p><p>2:00-4:00</p><p><strong>Register your attendance below.</strong></p>",
    "venue": "Terrace Room, Level 6 of Building 14\r\nUQ St. Lucia Campus",
    "startUtc": "2016-07-27T14:00:00+10:00",
    "endUtc": "2016-07-27T16:00:00+10:00",
    "start": "2016-07-28T00:00:00+10:00",
    "end": "2016-07-28T02:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444529,
    "title": "Employers on Campus:  Department of Defence",
    "summary": "STEM and IT students, are you interested in a career in Intelligence? Attend a panel discussion about opportunities available for civilian Australian Public Service (APS) opportunities in the Department of Defence for graduates.",
    "details": "<p>Want to make a difference? Defence is seeking graduates from across all academic disciplines to take up the challenge of working for one of Australia's most dynamic organisations, with a mission of national and international significance.<br> <br> Defence offers civilian staff the opportunity to play a real part in keeping Australia secure, to support intelligence operations nationally and internationally, and to support peace keeping missions overseas.</p><p>STEM and IT students, are you interested in a career in Intelligence? Attend a panel discussion about opportunities available for civilian Australian Public Service (APS) opportunities in the Department of Defence for graduates.</p><p>Presentation Content: &nbsp;Experienced Graduate Managers and Defence Graduates will provide an insight into the career opportunities available and how to make your application stand out.</p><p>18 August 2016&nbsp;</p><p>1:00-3:00</p><p>Innes Room, UQ Union Complex Building 21C</p><p>Register your attendance below. &nbsp;</p>",
    "venue": "Innes Room, UQ Union Complex Building 21C\r\nSt. Lucia Campus",
    "startUtc": "2016-08-18T13:00:00+10:00",
    "endUtc": "2016-08-18T15:00:00+10:00",
    "start": "2016-08-18T23:00:00+10:00",
    "end": "2016-08-19T01:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444532,
    "title": "Employers on Campus:  Department of Foreign Affairs and Trade (DFAT)",
    "summary": "Come along to this presentation and hear what it's like to work at DFAT, both domestically and abroad, and learn about DFAT's recruitment process.",
    "details": "<p>The role of the Department of Foreign Affairs and Trade is to help make Australia stronger, safer and more prosperous by promoting and protecting our interests internationally and contributing to global stability and economic growth. <br> <br> We manage a network of 96 overseas posts in five continents and we have more than 4,200 staff – located in Canberra, state and territory offices and overseas posts.</p><p>The Department of Foreign Affairs and Trade will present on what it is like to work at DFAT both here in Australia and overseas. DFAT will also walk students through the graduate recruitment process and answer any questions students may have.</p><p>16 August, 2016 </p><p>9:00-11:00</p><p>Terrace Room, Level 6 Building 14</p><p>St. Lucia Campus</p><p>Register your attendance below. &nbsp;</p>",
    "venue": "Terrace Room, Level 6 Building 14\r\nSt. Lucia Campus",
    "startUtc": "2016-08-16T09:00:00+10:00",
    "endUtc": "2016-08-16T11:00:00+10:00",
    "start": "2016-08-16T19:00:00+10:00",
    "end": "2016-08-16T21:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444534,
    "title": "Employers on Campus:  LinkedPower",
    "summary": "LinkedPower will demonstrate a range of job opportunities for international students in Queensland and China including secret resume tips, effective interview techniques and successful career planning strategies.",
    "details": "<p><strong>Organisation Blurb:</strong></p><p>LinkedPower devotes itself to establishing the largest Job Website for multilingual talents in the world and a reliable partner for international firms, linking them with global markets. Equipped with the latest Internet recruiting technology and professional human resources service, LinkedPower provides efficient and precise one-stop recruitment service and quality self-managed online user experience.</p><p><strong>Content presentation:</strong></p><p>In this presentation the Founder of LinkedPower, and the HRD &amp; recruitment consultant will discuss how to make the most of online resources in finding jobs and effectively utilise social networking to create job opportunities. We will demonstrate a whole range of  job opportunities for international students in Queensland  and China including secret resume tips, effective interview techniques and successful career planning strategies. </p><p><strong>Topics:</strong></p><ul>\r\n<li>The integration of possible resources and how to make the most of these resources in finding jobs</li></ul><ul>\r\n<li>Effectively utilise social networking to achieve job opportunities</li></ul><ul>\r\n<li>Welcome policies and incentives of Queensland  and China to attract international students as talents</li></ul><ul>\r\n<li>Demonstrate  job opportunities</li></ul><p>While presenting the above topics, real examples will be provided, resume tips, interview techniques and career planning knowledge will be addressed</p><p><strong>Guest speaker (TBC):</strong></p><p>Humming Lin, Bond Alumni; the Mayor’s international student ambassador in Gold Coast; Chairman of the Board (Gold Coast Chinese students and scholars Association); currently working in a reputable law firm.</p><p>28 July, 2016 &nbsp;10:00-12:00</p><p>Terrace Room, Level 6 Building 14</p><p>St. Lucia Campus</p><p>Register your attendance below.</p>",
    "venue": "Terrace Room, Level 6 Building 14\r\nSt. Lucia Campus",
    "startUtc": "2016-07-28T10:00:00+10:00",
    "endUtc": "2016-07-28T12:00:00+10:00",
    "start": "2016-07-28T20:00:00+10:00",
    "end": "2016-07-28T22:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444536,
    "title": "Employers on Campus: College of Professional Psychology",
    "summary": "The information session is for Psychology Students and Graduates to find out more about College's psychologists' registration program. It will help them make an informed decision becoming a registered psychologist through the College Program.",
    "details": "<p>The College of Professional Psychology was established 20 years ago and today hundreds of our graduates are registered practicing psychologists in diverse and varied workplace roles. Our well-established programs are designed to ensure proficiency in the core capabilities and attributes required by the Psychology Board of Australia for registration as a psychologist in Australia with AHPRA.</p><p>The College of Professional Psychology Psychologists Registration Program offers a structured coursework that is practical, supportive, and flexible. It provides individual and group supervision, professional development workshops, a high level of personal and administrative support, advice on AHPRA guidelines and preparation for the PBA exam to provisional psychologists undertaking the 4+2 and 5+1 pathways.</p><p>The information session is for Psychology Students and Graduates to find out more about College's psychologists' registration program. It will help them make an informed decision becoming a registered psychologist through the College Program.</p><p>15 August, 2016</p><p>9:00-11:00</p><p>Terrace Room, Level 6 Building 14</p><p>St. Lucia Campus</p><p>Register your attendance below.</p>",
    "venue": "Terrace Room, Level 6 Building 14\r\nSt. Lucia Campus",
    "startUtc": "2016-08-15T09:00:00+10:00",
    "endUtc": "2016-08-15T11:00:00+10:00",
    "start": "2016-08-15T19:00:00+10:00",
    "end": "2016-08-15T21:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 444750,
    "title": "Employers on Campus:  Hudson (legal)",
    "summary": "Hudson is a global talent solutions company with expertise in leadership and specialised recruitment, recruitment process outsourcing, talent managment and contracting solutions.  Come along to this presentation to hear about the legal market in QLD and how to differentiate yourself from others.",
    "details": "<p>Hudson is a global talent solutions company with expertise in leadership and specialised recruitment, recruitment process outsourcing, talent managment and contracting solutions.&nbsp; We combine broad geographic presence, world-class talent solutions and a tailored, consultative approach to help businesses and professional achieve higher performance and outstanding results.&nbsp;&nbsp;</p><p>Our team of dedicated legal consultants has earned the respect of their  legal clients from a range of industry sectors including banking and  finance, construction, consumer, mining and oil and gas. <strong></strong>We have strong relationships with many top Australian and international law firms. Hudson  is also a preferred service provider to a wide range of federal, state  and local government authorities, as well as statutory bodies,  government corporations and non-profit organisations.</p><p>Presentation Content: &nbsp;We will cover the legal market today, what employers are looking for &amp; having resilience and being proactive as well as the complexities of the current legal employment market and what students can do to differentiate themselves from other candidates. We will also discuss how to proactively and physically market yourself at the initial and interview stages.</p><p>Thursday 28 July 2016<br>1:00-2:00</p><p>Terrace Room<br>Level 6, Building 14<br>St. Lucia Campus</p><p>Register your attendance below. &nbsp;</p>",
    "venue": "Thursday 28 July 2016\r\n1:00-2:00\r\n\r\nTerrace Room\r\nLevel 6, Building 14\r\nSt. Lucia Campus",
    "startUtc": "2016-07-28T13:00:00+10:00",
    "endUtc": "2016-07-28T14:00:00+10:00",
    "start": "2016-07-28T23:00:00+10:00",
    "end": "2016-07-29T00:00:00+10:00",
    "email": "",
    "phone": ""
  },
  {
    "id": 459968,
    "title": "Employers on Campus:  Chartered Accountants Australia and New Zealand",
    "summary": "Chartered Accountants Australia and New Zealand represents 100,000 current and aspiring business leaders.\r\n\r\nWe’re Australia and New Zealand’s only member of the Global Accounting Alliance (GAA) – Giving our members a network of over 1,000,0000 qualified accountants, working in 180 countries.",
    "details": "<p>Chartered Accountants Australia and New Zealand represents 100,000 current and aspiring business leaders.</p><p>Our members work in diverse roles across commerce and industry, academia, government, and public practice throughout Australia and New Zealand and around the world.</p><p>We’re Australia and New Zealand’s only member of the Global Accounting Alliance (GAA) – Giving our members a network of over 1,000,0000 qualified accountants, working in 180 countries.</p><p>Terrace Room, Level 6 Building 14</p><p>St. Lucia Campus</p><p>9 August 2016 1:30-3:30</p><p><strong><em>Seating is limited so reserve your place below. &nbsp;</em></strong></p>",
    "venue": "Terrace Room, Level 6 Building 14\r\nUQ St. Lucia Campus",
    "startUtc": "2016-08-09T13:30:00+10:00",
    "endUtc": "2016-08-09T15:30:00+10:00",
    "start": "2016-08-09T23:30:00+10:00",
    "end": "2016-08-10T01:30:00+10:00",
    "email": "",
    "phone": ""
  }
]